<template>
    <div class="faq">
        <div class="faq__content">
            <div class="faq__title">FAQ</div>
            <div class="faq__questions">
                <faq-question
                    v-for="question in questions"
                    :key="question.id"
                    :question-data="question"
                />
            </div>
            <div class="faq__enable-btn">
                <EnableButton />
            </div>
        </div>
    </div>
</template>

<script>
import EnableButton from '../elements/EnableButton';
import FaqQuestion from './FaqQuestion';
export default {
    name: 'Faq',
    components: { FaqQuestion, EnableButton },
    props: {},
    data() {
        return {
            questions: [
                {
                    id: 1,
                    question: 'Что нужно для подключения?',
                    answer:
                        'Для подключения нужно оставить заявку на сайте. После этого наш менеджер свяжется с вами для согласования условий сотрудничества.'
                },
                {
                    id: 2,
                    question: 'Сколько длится подключение?',
                    answer:
                        'В зависимости от технической готовности сайта, подключение занимает от 3 дней.'
                },
                {
                    id: 3,
                    question: 'Нужно ли открывать счет в банке-партнере?',
                    answer: 'Нет, счет может быть открыт в любом банке РК.'
                },
                {
                    id: 4,
                    question: 'Кто осуществляет интеграцию?',
                    answer:
                        'Интеграцию осуществляют технические специалисты с вашей стороны.'
                },
                {
                    id: 5,

                    question: 'В каком виде будет отчетность?',
                    answer:
                        'Со своей стороны мы ежемесячно выставляем счета на абонентскую плату и закрываем их актами. По договору с банком - эквайером, вы будете получать ежедневные реестры платежей. Дополнительная информация предоставляется банком по запросу.'
                },
                {
                    id: 6,
                    question: 'Как происходит списание комиссии?',
                    answer:
                        'Вы получаете возмещение по операциям уже за вычетом комиссии.'
                },
                {
                    id: 7,
                    question: 'Как осуществляется вывод денежных средств?',
                    answer:
                        'Вывод средств возможен только на расчетный счет, без комиссии.'
                },
                {
                    id: 8,
                    question:
                        'В какие сроки осуществляется перечисление средств на расчетный счет?',
                    answer:
                        'Перечисление средств на расчетный счет вашей компании осуществляется не позднее, чем на 3 - й день.'
                },
                {
                    id: 9,
                    question:
                        'Могут ли мои клиенты оплачивать в долларах/евро?',
                    answer: 'Да, такая возможность есть.'
                },
                {
                    id: 10,
                    question: 'Можно ли подключить мобильное приложение?',
                    answer:
                        'Да, для интеграции в мобильные приложения у нас есть SDK под iOS и Android.'
                },
                {
                    id: 11,
                    question: 'Как происходит возврат/отмена платежа?',
                    answer:
                        'Возврат/частичный возврат или отмена платежа осуществляется через ваш личный кабинет в системе Tarlan Payments, нажатием одной кнопки. Комиссия за возврат не взимается, однако уже списанная за платеж комиссия не возвращается.'
                },
                {
                    id: 12,
                    question: 'В какие сроки осуществляется возврат?',
                    answer:
                        'На стороне Tarlan Payments возврат осуществляется моментально, однако сроки зачисления средств на карту плательщика зависят исключительно от банка - эмитента, в среднем от 1 до 14 дней.'
                },
                {
                    id: 13,
                    question: 'Есть ли рекуррентные платежи?',
                    answer: 'Да, есть.'
                },
                {
                    id: 14,
                    question: 'Можно ли работать без 3DS?',
                    answer: 'Можно, по согласованию.'
                },
                {
                    id: 15,
                    question: 'Работаете ли вы с физ.лицами?',
                    answer: 'Нет, мы работаем только с юр.лицами и ИП.'
                },
                {
                    id: 16,
                    question:
                        'Есть ли возможность блокировки (холдирования) денежных средств?',
                    answer:
                        'Да, есть. Стандартный срок блокировки– 5 дней. Списание необходимо подтверждать вручную до истечения срока блокировки, по истечению срока блокировки платеж будет разблокирован автоматически.'
                },
                {
                    id: 17,
                    question:
                        'Возможно ли выставить счет покупателю/сформировать ссылку на оплату?',
                    answer:
                        'Да, в личном кабинете системы Tarlan Payments можно выставить счет на электронную почту или по sms, в разделе «Терминал».'
                },
                {
                    id: 18,
                    question: 'Можно ли переложить комиссию на покупателя?',
                    answer:
                        'Некоторым категориям деятельности международные платежные системы разрешают перекладывать комиссии на покупателя. За более подробной информацией обращайтесь к нашим менеджерам.'
                },
                {
                    id: 19,
                    question: 'Каким требованиям должен соответствовать сайт?',
                    answer:
                        'Базовыми требованиями является наличие на сайте в открытом доступе следующей информации: полные реквизиты компании, контактная информация, способы оплаты и информация о доставке, правила отмены/возврата заказа и возврата средств, политика конфиденциальности и информация о безопасности платежей.'
                },
                {
                    id: 20,
                    question: 'Есть ли возможность привязки/запоминания карт?',
                    answer: 'Да, такая возможность есть.'
                }
            ]
        };
    },
    computed: {},
    methods: {}
};
</script>
